#@ # 
#@ # Running pt_shell Version G-2012.06-SP3 for amd64 -- Oct 19, 2012
#@ # Date:   Fri Feb 28 15:59:52 2014
#@ # Run by: williaml@cmos
#@ 

source /uusoc/facility/cad_common/Synopsys/pts_G-2012.06-SP3/admin/setup/.synopsys_pt.setup
#@ # -- Starting source /uusoc/facility/cad_common/Synopsys/pts_G-2012.06-SP3/admin/setup/.synopsys_pt.setup

#@ #
#@ # .synopsys_pt.setup: Initialization File for PrimeTime
#@ #
#@ 
#@ 
#@ #
#@ # Enable stack trace output on fatal.  Not available for all architectures.
#@ #
#@ if { $sh_arch == "sparcOS5" || $sh_arch == "hpux10" ||      $sh_arch == "hp32" || $sh_arch == "linux" } {
#@   set_unix_variable SYNOPSYS_TRACE ""
#@ }
#@ 
#@ #
#@ # Variable settings
#@ #
#@ 
#@ #
#@ # Synopsys strongly recommends that you use new variable message
#@ # tracing for debugging purposes only.
#@ #
#@ set sh_new_variable_message true
#@ 
#@ #
#@ # Synopsys strongly recommends that you uncomment the following command
#@ # in order to set sh_command_abbrev_mode to the value "Command-Line-Only".
#@ # Command abbreviation is intended as an interactive convenience.  Using
#@ # abbreviations in scripts can cause commands to fail in subsequent releases.
#@ # 
#@ #set sh_command_abbrev_mode "Command-Line-Only"
#@ 
#@ #
#@ # Some useful aliases
#@ #
#@ alias list_commands		help
#@ alias report_constraints	report_constraint
#@ alias report_clocks		report_clock
#@ 
#@ #
#@ # The alias for get_clock was added when get_clock_network_objects
#@ # was introduced, as it conflicts with get_clocks (and get_clock is a
#@ # typical abbreviation for get_clocks)
#@ #
#@ alias get_clock get_clocks
#@ 
#@ 
#@ #
#@ #
#@ # The alias of q to quit is commented out.  Remove the comment 
#@ # character if you want this alias.  Some users find that having 
#@ # this particular alias causes problems when mixed with page-mode
#@ # for reports - an accidental repeated 'q' not only cancels the
#@ # output but exits the tool.
#@ #
#@ #alias q quit
#@ 
#@ # -- End source /uusoc/facility/cad_common/Synopsys/pts_G-2012.06-SP3/admin/setup/.synopsys_pt.setup

set design_dir   "."
.
set design_dir   "."
.
set mw_power_port  VDD
.
set mw_logic1_net  VDD
.
set power_enable_analysis TRUE
.
read_file -f verilog FFT_4_APR.v
.
read_sdc $design_name.dcopt.sdc
.
read_parasitics -increment -format SPEF FFT_4.spef
.
report_disable_timing >> timing_report.pt.txt
.
